Revit 2024 API
CurtainGrid.GetCell Method
 Get the specified cell located by the intersection of the grid lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public CurtainCell GetCell(
	ElementId uGridLineId,
	ElementId vGridLineId
)
Visual Basic
Public Function GetCell ( _
	uGridLineId As ElementId, _
	vGridLineId As ElementId _
) As CurtainCell
Visual C++
public:
CurtainCell^ GetCell(
	ElementId^ uGridLineId,
	ElementId^ vGridLineId
)
Parameters
uGridLineId
Type: Autodesk.Revit.DB.ElementId
 The id of a grid line in the U-direction used to locate the cell.
vGridLineId
Type: Autodesk.Revit.DB.ElementId
 The id of a grid line in the V-direction used to locate the cell.
Return Value
 The cell.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException | Thrown if the grid line ids are not part of this curtain grid.
See Also
CurtainGrid Class
Autodesk.Revit.DB Namespace